BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega2564RFR2.PIC
        <edc:AdjustPoint edc:_addr="0x13A" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x13C" edc:access="n-n-nn--" edc:cname="AES_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="AES_IM" edc:desc="AES Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_DIR" edc:desc="Set AES Operation Direction" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AES_DIR_ENC" edc:desc="AES operation is encryption." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AES_DIR_DEC" edc:desc="AES operation is decryption." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_MODE" edc:desc="Set AES Operation Mode" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AES_MODE_ECB" edc:desc="AES Mode is ECB (Electronic Code Book)." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AES_MODE_CBC" edc:desc="AES Mode is CBC (Cipher Block Chaining)." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_REQUEST" edc:desc="Request AES Operation." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x13D" edc:access="n------n" edc:cname="AES_STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AES_DONE" edc:desc="AES Operation Finished with Success" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="AES_ER" edc:desc="AES Operation Finished with Error" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x13E" edc:access="nnnnnnnn" edc:cname="AES_STATE" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AES_STATE" edc:desc="AES Plain and Cipher Text Buffer" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x13F" edc:access="nnnnnnnn" edc:cname="AES_KEY" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AES_KEY" edc:desc="AES Encryption/Decryption Key Buffer" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x140" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x141" edc:access="nnnnnnnn" edc:cname="TRX_STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRX_STATUS" edc:desc="Transceiver Main Status" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="P_ON" edc:desc="P_ON" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BUSY_RX" edc:desc="BUSY_RX" edc:when="(field &amp; 0x1F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="BUSY_TX" edc:desc="BUSY_TX" edc:when="(field &amp; 0x1F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="RX_ON" edc:desc="RX_ON" edc:when="(field &amp; 0x1F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="TRX_OFF" edc:desc="TRX_OFF" edc:when="(field &amp; 0x1F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="PLL_ON" edc:desc="PLL_ON" edc:when="(field &amp; 0x1F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="SLEEP" edc:when="(field &amp; 0x1F) == 0x0F"/>
                <edc:SFRFieldSemantic edc:cname="BUSY_RX_AACK" edc:desc="BUSY_RX_AACK" edc:when="(field &amp; 0x1F) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="BUSY_TX_ARET" edc:desc="BUSY_TX_ARET" edc:when="(field &amp; 0x1F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="RX_AACK_ON" edc:desc="RX_AACK_ON" edc:when="(field &amp; 0x1F) == 0x16"/>
                <edc:SFRFieldSemantic edc:cname="TX_ARET_ON" edc:desc="TX_ARET_ON" edc:when="(field &amp; 0x1F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="STATE_TRANSITION_IN_PROGRESS" edc:desc="STATE_TRANSITION_IN_PROGRESS" edc:when="(field &amp; 0x1F) == 0x1F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TST_STATUS" edc:desc="Test mode status" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="TST_DISABLED" edc:desc="Test mode is disabled." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="TST_ENABLED" edc:desc="Test mode is active." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CCA_STATUS" edc:desc="CCA Status Result" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="CCA_BUSY" edc:desc="Channel indicated as busy." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="CCA_IDLE" edc:desc="Channel indicated as idle." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CCA_DONE" edc:desc="CCA Algorithm Status" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="CCA_NOT_FIN" edc:desc="CCA calculation not finished" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="CCA_FIN" edc:desc="CCA calculation finished" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x142" edc:access="nnnnnnnn" edc:cname="TRX_STATE" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRX_CMD" edc:desc="State Control Command" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="CMD_NOP" edc:desc="NOP" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="CMD_TX_START" edc:desc="TX_START" edc:when="(field &amp; 0x1F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CMD_FORCE_TRX_OFF" edc:desc="FORCE_TRX_OFF" edc:when="(field &amp; 0x1F) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="CMD_FORCE_PLL_ON" edc:desc="FORCE_PLL_ON" edc:when="(field &amp; 0x1F) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="CMD_RX_ON" edc:desc="RX_ON" edc:when="(field &amp; 0x1F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="CMD_TRX_OFF" edc:desc="TRX_OFF" edc:when="(field &amp; 0x1F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="CMD_PLL_ON" edc:desc="PLL_ON (TX_ON)" edc:when="(field &amp; 0x1F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="CMD_RX_AACK_ON" edc:desc="RX_AACK_ON" edc:when="(field &amp; 0x1F) == 0x16"/>
                <edc:SFRFieldSemantic edc:cname="CMD_TX_ARET_ON" edc:desc="TX_ARET_ON" edc:when="(field &amp; 0x1F) == 0x19"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TRAC_STATUS" edc:desc="Transaction Status" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="TRAC_SUCCESS" edc:desc="SUCCESS (RX_AACK, TX_ARET)" edc:when="(field &amp; 0x7) == 0"/>
                <edc:SFRFieldSemantic edc:cname="TRAC_SUCCESS_DATA_PENDING" edc:desc="SUCCESS_DATA_PENDING (TX_ARET)" edc:when="(field &amp; 0x7) == 1"/>
                <edc:SFRFieldSemantic edc:cname="TRAC_SUCCESS_WAIT_FOR_ACK" edc:desc="SUCCESS_WAIT_FOR_ACK (RX_AACK)" edc:when="(field &amp; 0x7) == 2"/>
                <edc:SFRFieldSemantic edc:cname="TRAC_CHANNEL_ACCESS_FAILURE" edc:desc="CHANNEL_ACCESS_FAILURE (TX_ARET)" edc:when="(field &amp; 0x7) == 3"/>
                <edc:SFRFieldSemantic edc:cname="TRAC_NO_ACK" edc:desc="NO_ACK (TX_ARET)" edc:when="(field &amp; 0x7) == 5"/>
                <edc:SFRFieldSemantic edc:cname="TRAC_INVALID" edc:desc="INVALID (RX_AACK, TX_ARET)" edc:when="(field &amp; 0x7) == 7"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x143" edc:access="nnnn----" edc:cname="TRX_CTRL_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PMU_IF_INV" edc:desc="PMU IF Inverse" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMU_START" edc:desc="Start of Phase Measurement Unit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMU_EN" edc:desc="Enable Phase Measurement Unit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res7" edc:desc="Reserved" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
