BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega2564RFR2.PIC
        <edc:SFRDef edc:_addr="0x165" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x166" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_2" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x167" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_3" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x168" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_4" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x169" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_5" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16A" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_6" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16B" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_7" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_" edc:desc="MAC IEEE Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16C" edc:access="nnnnnnnn" edc:cname="XAH_CTRL_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLOTTED_OPERATION" edc:desc="Set Slotted Acknowledgment" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="SLOTTED_OP_DIS" edc:desc="The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="SLOTTED_OP_EN" edc:desc="The transmission of an acknowledgment frame has to be controlled by the microcontroller." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAX_CSMA_RETRIES" edc:desc="Maximum Number of CSMA-CA Procedure Repetition Attempts" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="No repetition of CSMA-CA procedure" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="One repetition of CSMA-CA procedure" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Five repetitions (highest IEEE 802.15.4 compliant value)" edc:when="(field &amp; 0x7) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Immediate frame re-transmission without performing CSMA-CA" edc:when="(field &amp; 0x7) == 0x7"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAX_FRAME_RETRIES" edc:desc="Maximum Number of Frame Re-transmission Attempts" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Retransmission of frame is not attempted." edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="Retransmission of frame is attempted once." edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Retransmission of frame is attempted 15 times." edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16D" edc:access="nnnnnnnn" edc:cname="CSMA_SEED_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSMA_SEED_00" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_01" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_02" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_03" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_04" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_05" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_06" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSMA_SEED_07" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
