BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega2564RFR2.PIC
        <edc:SFRDef edc:_addr="0x16E" edc:access="nnnnnnnn" edc:cname="CSMA_SEED_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSMA_SEED_1" edc:desc="Seed Value for CSMA Random Number Generator" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AACK_I_AM_COORD" edc:desc="Set Personal Area Network Coordinator" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_DIS_ACK" edc:desc="Disable Acknowledgment Frame Transmission" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_SET_PD" edc:desc="Set Frame Pending Sub-field" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_FVN_MODE" edc:desc="Acknowledgment Frame Filter Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Acknowledge frames with version number 0" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Acknowledge frames with version number 0 or 1" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Acknowledge frames with version number 0 or 1 or 2" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Acknowledge frames independent of frame version number" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x16F" edc:access="nnnnnnnn" edc:cname="CSMA_BE" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MIN_BE" edc:desc="Minimum Back-off Exponent" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Minimum value of minimum back-off exponent." edc:when="(field &amp; 0xF) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="..." edc:when="(field &amp; 0xF) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_8" edc:desc="Maximum value of minimum back-off exponent. MIN_BE must be smaller or equal to MAX_BE." edc:when="(field &amp; 0xF) == 8"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAX_BE" edc:desc="Maximum Back-off Exponent" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="This value is not valid for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="This value is not valid for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Minimum, IEEE compliant value for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_4" edc:desc="..." edc:when="(field &amp; 0xF) == 4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_8" edc:desc="Maximum, IEEE compliant value for the maximum back-off exponent." edc:when="(field &amp; 0xF) == 8"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x170" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0x176" edc:access="----nnnn" edc:cname="TST_CTRL_DIGI" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TST_CTRL_DIG" edc:desc="Digital Test Controller Register" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="NORMAL (no test is active)" edc:when="(field &amp; 0xF) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_15" edc:desc="TST_CONT_TX (continuous transmit)" edc:when="(field &amp; 0xF) == 15"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x177" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0x17B" edc:access="nnnnnnnn" edc:cname="TST_RX_LENGTH" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX_LENGTH" edc:desc="Received Frame Length" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x17C" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0x180" edc:access="nnnnnnnn" edc:cname="TRXFBST" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24"/>
        <edc:AdjustPoint edc:_addr="0x181" edc:offset="0x7E"/>
        <edc:SFRDef edc:_addr="0x1FF" edc:access="nnnnnnnn" edc:cname="TRXFBEND" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24"/>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:beginaddr="0x200" edc:endaddr="0x8200" edc:regionid="IRAM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:DataFlashSpace edc:endaddr="0x400" edc:magicoffset="0x810000"/>
  <edc:SignaturesSpace edc:magicoffset="0x840000">
    <edc:DeviceIDSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="SIGNATURES" edc:value="0x1EA803"/>
  </edc:SignaturesSpace>
  <edc:UserSignaturesSpace>
    <edc:UserIDSector edc:beginaddr="0x100" edc:endaddr="0x400" edc:regionid="USER_SIGNATURES"/>
  </edc:UserSignaturesSpace>
  <edc:FusesSpace edc:magicoffset="0x820000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnn" edc:cname="LOW" edc:factorydefault="0x62" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CKSEL_SUT" edc:desc="Select Clock Source : Start-up time" edc:nzwidth="0x6">
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_0MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_4MS1" edc:desc="Ext. Clock; Start-up time: 6 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_65MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_6CK_0MS" edc:desc="Int. RC Osc.; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_6CK_4MS1" edc:desc="Int. RC Osc.; Start-up time: 6 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_6CK_65MS" edc:desc="Int. RC Osc.; Start-up time: 6 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_128KHZ_6CK_0MS" edc:desc="Int. 128kHz RC Osc.; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_128KHZ_6CK_4MS1" edc:desc="Int. 128kHz RC Osc.; Start-up time: 6 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_128KHZ_6CK_65MS" edc:desc="Int. 128kHz RC Osc.; Start-up time: 6 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x1A"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2A"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x3A"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1B"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x2B"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x3B"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x0C"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x1C"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2C"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x3C"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x0D"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1D"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x2D"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x3D"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x0E"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_258CK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x1E"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2E"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x3E"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_1KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x0F"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_0MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_4MS1" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:DCRFieldSemantic edc:cname="TOSC_16KCK_65MS" edc:desc="Tranceiver Oscillator; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CKOUT" edc:desc="Clock output on PORTE7" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="CKDIV8" edc:desc="Divide clock by 8 internally" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
